Krasutski/nrf5-ble-take-photo-button/main.c
#define FIRST_CONN_PARAMS_UPDATE_DELAY                                                                               \
    APP_TIMER_TICKS(5000, APP_TIMER_PRESCALER) /**< Time from initiating event (connect or start of notification) to \
                                                  first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY                                                                                 \
    APP_TIMER_TICKS(30000, APP_TIMER_PRESCALER) /**< Time between each call to sd_ble_gap_conn_param_update after the \
                                                   first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT 3 /**< Number of attempts before giving up the connection parameter negotiation. \
                                        */

#define SEC_PARAM_BOND            1                    /**< Perform bonding. */
#define SEC_PARAM_MITM            0                    /**< Man In The Middle protection not required. */
#define SEC_PARAM_LESC            0                    /**< LE Secure Connections not enabled. */
#define SEC_PARAM_KEYPRESS        0                    /**< Keypress notifications not enabled. */
#define SEC_PARAM_IO_CAPABILITIES BLE_GAP_IO_CAPS_NONE /**< No I/O capabilities. */
#define SEC_PARAM_OOB             0                    /**< Out Of Band data not available. */
#define SEC_PARAM_MIN_KEY_SIZE    7                    /**< Minimum encryption key size. */
#define SEC_PARAM_MAX_KEY_SIZE    16                   /**< Maximum encryption key size. */

#define OUTPUT_REPORT_INDEX       0 /**< Index of Output Report. */
#define OUTPUT_REPORT_MAX_LEN     1 /**< Maximum length of Output Report. */
#define INPUT_REPORT_KEYS_INDEX   0 /**< Index of Input Report. */
#define INPUT_CCONTROL_KEYS_INDEX 1
#define OUTPUT_REPORT_BIT_MASK_CAPS_LOCK                                                                       \
    0x02 /**< CAPS LOCK bit in Output Report (based on 'LED Page (0x08)' of the Universal Serial Bus HID Usage \
            Tables). */
#define INPUT_REP_REF_ID    1 /**< Id of reference to Keyboard Input Report. */
#define INPUT_CC_REP_REF_ID 2
#define OUTPUT_REP_REF_ID   0 /**< Id of reference to Keyboard Output Report. */

#define APP_FEATURE_NOT_SUPPORTED \
    BLE_GATT_STATUS_ATTERR_APP_BEGIN + 2 /**< Reply when unsupported features are requested. */

#define MAX_BUFFER_ENTRIES 5 /**< Number of elements that can be enqueued */

#define BASE_USB_HID_SPEC_VERSION \
    0x0101 /**< Version number of base USB HID Specification implemented by this application. */
#define INPUT_CC_REPORT_KEYS_MAX_LEN 1
#define INPUT_REPORT_KEYS_MAX_LEN    8 /**< Maximum length of the Input Report characteristic. */

#define DEAD_BEEF \
    0xDEADBEEF /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define SCHED_MAX_EVENT_DATA_SIZE \
    MAX(APP_TIMER_SCHED_EVT_SIZE, BLE_STACK_HANDLER_SCHED_EVT_SIZE) /**< Maximum size of scheduler events. */
#ifdef SVCALL_AS_NORMAL_FUNCTION
#    define SCHED_QUEUE_SIZE \
        20 /**< Maximum number of events in the scheduler queue. More is needed in case of Serialization. */
#else
#    define SCHED_QUEUE_SIZE 10 /**< Maximum number of events in the scheduler queue. */
#endif

#define MODIFIER_KEY_POS 0 /**< Position of the modifier byte in the Input Report. */
#define SCAN_CODE_POS                                                                                               \
    2 /**< This macro indicates the start position of the key scan code in a HID Report. As per the document titled \
         'Device Class Definition for Human Interface Devices (HID) V1.11, each report shall have one modifier byte \
         followed by a reserved constant byte and then the key scan code. */
#define SHIFT_KEY_CODE 0x02 /**< Key code indicating the press of the Shift Key. */

#define MAX_KEYS_IN_ONE_REPORT   \
    (INPUT_REPORT_KEYS_MAX_LEN - \
     SCAN_CODE_POS) /**< Maximum number of key presses that can be sent in one Input Report. */

/**Buffer queue access macros
 *
 * @{ */
/** Initialization of buffer list */
#define BUFFER_LIST_INIT()     \
    do {                       \
        buffer_list.rp = 0;    \
        buffer_list.wp = 0;    \
        buffer_list.count = 0; \
    } while (0)

/** Provide status of data list is full or not */
#define BUFFER_LIST_FULL() ((MAX_BUFFER_ENTRIES == buffer_list.count - 1) ? true : false)

/** Provides status of buffer list is empty or not */
#define BUFFER_LIST_EMPTY() ((0 == buffer_list.count) ? true : false)

#define BUFFER_ELEMENT_INIT(i)                 \
    do {                                       \
        buffer_list.buffer[(i)].p_data = NULL; \
    } while (0)

/** @} */

typedef enum {
    BLE_NO_ADV,             /**< No advertising running. */
    BLE_DIRECTED_ADV,       /**< Direct advertising to the latest central. */
    BLE_FAST_ADV_WHITELIST, /**< Advertising with whitelist. */
    BLE_FAST_ADV,           /**< Fast advertising running. */
    BLE_SLOW_ADV,           /**< Slow advertising running. */
    BLE_SLEEP,              /**< Go to system-off. */
} ble_advertising_mode_t;

/** Abstracts buffer element */
typedef struct hid_key_buffer {
    uint8_t data_offset;    /**< Max Data that can be buffered for all entries */
    uint8_t data_len;       /**< Total length of data */
    uint8_t *p_data;        /**< Scanned key pattern */
    ble_hids_t *p_instance; /**< Identifies peer and service instance */
} buffer_entry_t;

STATIC_ASSERT(sizeof(buffer_entry_t) % 4 == 0);

/** Circular buffer list */
typedef struct {
    buffer_entry_t buffer[MAX_BUFFER_ENTRIES]; /**< Maximum number of entries that can enqueued in the list */
    uint8_t rp;                                /**< Index to the read location */
    uint8_t wp;                                /**< Index to write location */
    uint8_t count;                             /**< Number of elements in the list */
} buffer_list_t;

STATIC_ASSERT(sizeof(buffer_list_t) % 4 == 0);

static ble_hids_t m_hids;                                /**< Structure used to identify the HID service. */
static ble_bas_t m_bas;                                  /**< Structure used to identify the battery service. */
static bool m_in_boot_mode = false;                      /**< Current protocol mode. */
static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID; /**< Handle of the current connection. */

static sensorsim_cfg_t m_battery_sim_cfg;     /**< Battery Level sensor simulator configuration. */
static sensorsim_state_t m_battery_sim_state; /**< Battery Level sensor simulator state. */

APP_TIMER_DEF(m_battery_timer_id); /**< Battery timer. */
APP_TIMER_DEF(m_power_off_timer_id);

static pm_peer_id_t m_peer_id; /**< Device reference handle to the current bonded central. */
static bool m_caps_on = false; /**< Variable to indicate if Caps Lock is turned on. */

static pm_peer_id_t
    m_whitelist_peers[BLE_GAP_WHITELIST_ADDR_MAX_COUNT]; /**< List of peers currently in the whitelist. */
static uint32_t m_whitelist_peer_cnt;                    /**< Number of peers currently in the whitelist. */
static bool m_is_wl_changed; /**< Indicates if the whitelist has been changed since last time it has been updated in the
                                Peer Manager. */

static ble_uuid_t m_adv_uuids[] = {
    { BLE_UUID_HUMAN_INTERFACE_DEVICE_SERVICE, BLE_UUID_TYPE_BLE }
};

/** List to enqueue not just data to be sent, but also related information like the handle, connection handle etc */
static buffer_list_t buffer_list;

