Krasutski/nrf5-ble-take-photo-button/main.c
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);

    nrf_gpio_cfg_sense_input(BUTTON_1, NRF_GPIO_PIN_NOPULL, NRF_GPIO_PIN_SENSE_LOW);
}

/**@brief Function for the Power manager.
 */
static void power_manage(void) {
    uint32_t err_code = sd_app_evt_wait();

    APP_ERROR_CHECK(err_code);
}

/**@brief Function for application main entry.
 */
int main(void) {
    bool erase_bonds;
    uint32_t err_code;

    // Initialize.
    err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    timers_init();
    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    scheduler_init();
    peer_manager_init(erase_bonds);
    if (erase_bonds == true) {
        NRF_LOG_INFO("Bonds erased!\r\n");
    }
    gap_params_init();
    advertising_init();
    services_init();
    sensor_simulator_init();
    conn_params_init();
    buffer_init();

    // Start execution.
    NRF_LOG_INFO("HID Keyboard Start!\r\n");
    timers_start();
    advertising_start();

    // Enter main loop.
    bool is_btn_pressed_prev = false;
    restart_power_off_timer();
    for (;;) {
        app_sched_execute();
        if (NRF_LOG_PROCESS() == false) {
            power_manage();
        }

        bool is_btn_pressed = (nrf_gpio_pin_read(BUTTON_1) == BUTTONS_ACTIVE_STATE);
        if (is_btn_pressed != is_btn_pressed_prev) {
            is_btn_pressed_prev = is_btn_pressed;
            if (is_btn_pressed) {
                app_timer_stop(m_power_off_timer_id);
                consumer_control_send(CONSUMER_CTRL_VOL_UP);
            } else {
                consumer_control_send(RELEASE_KEY);
                restart_power_off_timer();
            }
        }
    }
}

/**
 * @}
 */
